; DO NOT TRANSLATE COMMENTS!
; 
; This is a language file
; You can translate it into your native language
; To do this, follow instructions:
; - PLEASE make sure FDM hasn't already been translated into your language 
;   You should go to FDM web site (http://freedownloadmanager.org) and 
;   check the list of available languages
;   or e-mail to support@freedownloadmanager.org
; - copy this language file to xxx.lng, where xxx is the reduced name 
;   of your language. For English it is eng
; - translate all strings of xxx.lng into your language
; - send the translated file to support@freedownloadmanager.org 
;
; Translator - Matti Viljanen
;

; Specify your language name in English (and in your language), for example:
; Russian (Русский)
Finnish
; converted from windows-1252 to utf-16
;
; Below are the strings to translate:
; DO NOT TRANSLATE OR REMOVE COMMENTS!
Tallenna kaikki
Leikkaa
Kopioi
Liitä
Pieni nopeus
Kohtalainen nopeus
Täysi nopeus
Latausasetukset
Puhelinverkkoyhteys
Tietoja ohjelmasta
Sulje
Tiedosto
Muokkaa
Näytä
Asetukset
Työkalut
Ohje
Työkalurivi
Tilarivi
Optimointivelho
Latauksen oletusasetukset
Yleiset asetukset
Puhelinverkkoyhteys
Katkaise yhteys latauksen päätyttyä
Sammuta tietokone latauksen päätyttyä
Avaa ohjetiedosto
FDM:n kotosivu
Kerro kaverille
Sähköpostipalaute
Tarkista päivitykset automaattisesti
Tarkista päivitykset nyt
-
-
Vaihda
Kaistankäyttötila
Rekisterointi
Lataukset
Ajastin
Sivustoselain
HTTP//FTP-selain
Sivustomanageri
Lisää lataus
Aloita lataus
Lopeta lataus
Ajasta lataus
Lisää tehtävä
Tehtävän ominaisuudet
Lataa valitut tiedostot
Pysäytä
Päivitä
Lisää sivusto
Sivuston ominaisuudet
Latausryhmät
Latauksen tiedot
Ajastimen loki
Sivustoselaimen loki
Sivupalkki
Luo uusi lataus
Poista lataus
Suorita//avaa tiedosto
Avaa kansio
Suorita//avaa ladattu tiedosto automaattisesti
Latauksen asetukset
Suorita tehtävä
Älä suorita tehtävää
Poista tehtävä
Avaa ylempi kansio
Katkaise yhteys
Lataa
Sivustoselaimen asetukset
Poista sivusto
Väliaikainen tieto
Sivustot
Näytä pääikkuna
Selaimen tarkkailu
Leikepöydän tarkkailu
Aloita kaikki lataukset
Pysäytä kaikki lataukset
-
Jatka
-
-
-
-
-
Keskeytä
-
-
-
Kaikki ryhmät
Suodattimet
Valmis
Kesken
Ajastettu
Pysäytetty
Muu
Luo uusi ryhmä
Poista ryhmä
Poista kaikki lataukset
Poista kaikki valmiit lataukset
Avaa ryhmän kansio
Ryhmän ominaisuudet
Ryhmän nimi:
Oletuskansio:
Tiedostopäätteet [välilyöntierotteisesti]:
Latauksen oletusprioiriteetti:
Alhainen
Melko alhainen
Keskitaso
Melko korkea
Korkea
Anna ryhmän nimi
Syötevirhe
Samanniminen ryhmä on jo olemassa. Anna ryhmälle eri nimi
Anna kansion nimi
Valitse ryhmän oletuskansio
Kirjoita tähän ryhmän nimi
Tallenna ryhmän lataukset oletuksena kansioon
Selaa
Ryhmän käyttämät tiedostopäätteet. Tätä käytetään latauksen automaattiseen ryhmittelyyn
Ryhmän latauksen oletusprioriteetti
Kumoa muutokset ja sulje ikkuna
Vahvista muutokset ja sulje ikkuna
Virhe latausryhmissä
Asenna FDM uudestaan
Virhe
Latausten listaa ei voi ladata. Tiedosto voi olla vaurioitunut tai toisen sovelluksen käytössä
Internet Explorer -liitännäisosan käyttöönotto epäonnistui
Oletko varma?
Tämä poistaa kaikki ryhmälataukset
Vahvistus
Tiedostonimi
Koko
Ladattu
Aikaa jäljellä
Osat
Nopeus
Kommentti
Loki
Tilanne
Aika
Päivämäärä
Tietoja
Tyhjennä
Automaattinen vieritys
Tuntematon tietoverkkovirhe
Pääsy estetty. Virheellinen käyttäjätunnus tai salasana
Pääsy estetty. Virheellinen salasana
Onnstui
Palvelimeen ei saatu yhteyttä
Tiedostoa ei löydy palvelimelta
Yhteys palvelimeen katkesi
Palvelin ei vastaa
Palvelimen nimeä ei voitu selvittää
Palvelin ei tue latauksen jatkamista. Jos keskeytät tämän latauksen, sinun on ladattava se uudestaan alusta asti
Välityspalvelin vaatii käyttäjänimen ja salasanan
Jatkettu virhe
Virheellinen pyyntö. Osoite voi olla virheellinen
Tuntematon palvelinvirhe
Yhteys keskeytetty
Virheellinen osoite
Ei yhteyttä
Palvelin ei tue haluttua HTTP-versiota
Tuntematon virhe
Tiedostoa ei voitu poistaa levyltä
Palvelinyhteyksien yläraja saavutettu
Yhteyksien yläraja saavutettu
Tauko %d sek.
Osa
Aloitettu
Valmis
Lataus valmis
Yhdistetään...
Yhdistäminen onnistui.
Uudellenohjataan...
Uudelleenohjaus onnistui. Avataan uusi osoite...
Aloitetaan lataus...
Pysäytetty
Luodaan uusi osalataus...
Keskeytetty
Aloitetaan latausta uudelleen...
Avataan tiedostoa levyltä...
Tiedostonimi on liian pitkä
Tiedostonimi on jo olemassa. Uudellennimeä tiedostoksi
Nimeä uudelleen:
Latauksen tallennustiedosto poistettiin. Latausta ei voida jatkaa.
Tiedosto on jo olemassa. Kirjoitetaan päälle
Tiedosto on jo olemassa. Jatketaan latausta
Tiedosto on jo olemassa
Tiedoston avaaminen levyltä epäonnistui!
Tiedoston koko palvelimella on vaihtunut!
Mukaudutaan uuteen kokoon...
Tiedostoa ei voi ylikirjoittaa
Tiedosto uudelleennimetään
Tiedostoa ei voi nimetä takaisin alkuperäiseksi
Ryhmiä ei voitu tallentaa
Latauksia ei voida tallentaa
Puhelinverkkoyhteys
Yhdistä:
Soita automaattisesti
Yhdistä
Valitse haluamasi puhelinverkkoyhteys
Valitse tämä, jos haluat soitettavan tähän puhelinverkkoyhteyteen automaattisesti seuraavalla kerralla
Muodosta yhteys nyt
Älä muodosta yhteyttä ja sulje ikkuna
Tietokoneelta ei löytynyt puhelinverkkoyhteyksiä
Linja varattu
Laitteistovirhe
Ei valintaääntä
Soitetaa
Yritys
Avataan porttia...
Soitetaan palveluntarjoajalle...
Yhdistetään etäpalvelimeen...
Tarkistetaan käyttäjätunnus ja salasana...
Yhdistetty nopeudella %d bps
Katkaise yhteys
Toistetaan
Tarvitaan käyttäjätunnus ja salasana
Käyttäjätunnus:
Salasana:
Ryhmä:
Tallenna kansioon:
Tallenna nimella:
Aloita
Automaattisesti
Manuaalisesti
Ajasta
Latauksen tärkeysarvo
Lisävalinnat
URL-osoite tiedostoon, jonka haluat ladata
Anna käyttäjätunnus tähän
Anna salasana tähän
Palvelin vaatii kirjautumisen
Ryhmän nimi, johon haluat sijoittaa latauksen. Ryhmittely auttaa latausten hallinnassa
Kansion nimi, johon haluat tallentaa tiedoston
Tallenna tiedosto toiselle nimelle. Jätä tämä tyhjäksi, jos haluat käyttää alkuperäistä nimeä
Latauksen lyhyt kuvaus
Tämä lataus aloitetaan välittömästi
Latausta ei aloiteta automaattisesti
Ajasta tämän tiedoston lataus
Mukauta latausaikataulua
Latauksen prioriteetti. Korkean prioriteetin lataukset aloitetaan ensin, matalan prioriteetin lataukset myöhemmin
Näytä latauksen lisävaihtoehdot
URL-osoite on virheellinen, tarkista osoite
Anna käyttäjätunnus
Valitse tallennuskanio
Yleinen
Yleistä tietoa
Lataa nyt tallennettu tiedostoon:
Ladatun tiedoston nimi
Tämän latauksen URL-osoitetta ei voi muuttaa
Lataus on käynnissä. Tiedostonimeä ei voi muuttaa
Ei voida nimetä uudelleen
Tiedostoa ei löydy
Polkua ei löydy
Virheellinen exe-tiedosto
Toinen prosessi käyttää tiedostoa
Pääsy estetty.
Laite ei ole valmis
Levy täynnä
Virheellinen tiedostonimi
Kirjautumista edellytetään
Yhteys
Verkko
Virheet
Odotusaika yritysten välillä [sekuntia]:
Yrityskerrat
Aikakatkaisu [sekuntia]:
Pienin koko:
Suurin määrä:
Kaistanhallinta latauksen yhteydessä
Rajoita kaistankäyttöä
Ohita kaikki rajoitukset
t
Kt
Mt
; second. e.g. KB/s
s
Anna suurempi arvo kuin %d
Valitse ulottuvuus
Palvelinyhteyden uudelleenmuodostuksen odotusaika virhetilanteessa
Valitse tämä, jos haluat rajoittaa virhetilanteissa yhteyden uudelleenmuodostuskertojen lukumäärää
Palvelimen vastauksen odottamisaika
Latausosan pienin koko. Pienempiä latausosia ei luoda
Latausosien suurin määrä. Tiedosto ladataan korkeintaan näin monessa osassa
Määritä, kuinka paljon kaistaa FDM voi käyttää lataukseen
Ohita kaistarajoitukset ja yhteysmäärän ylärajan rajoitus tämän latauksen kohdalla
Voit antaa arvon tavuina (t), kilotavuina (Kt) tai megatavuina (Mt) tähän kenttään
Protokolla
Tunnistaudu serverille nimellä:
Viittaaja:
Käytä HTTP-versiota 1.1
Käytä evästeitä
Käytä passiivista tilaa
Siirtotila
Binääri
ASCII seuraavien tiedostotyyppien yhteydessä:
Määritä, miten FDM tunnistautuu latauspalvelimelle
Tämän kentän sisältö lähetetään viittajana latauspalvelimelle. Se ei kuitenkaan ole pakollinen.
Valitse tämä, jos haluat FDM:n käyttävän HTTP-protokollan versiota 1.1
Valitse tämä, jos haluat FDM:n käyttävän evästeitä tarvittaessa
Valitse tämä, jos haluat FDM:n käyttävän passiivista siirtotilaa FTP-yhteyksissä. Tämä voi olla tarpeen joidenkin palomuurien yhteydessä.
Käytä binäärisiirtomuotoa FTP-latauksissa. Käytä tätä muodoa muiden kuin tekstimuotoisten tiedostojen lataamisessa
Käytä ASCII-muotoa FTP-latauksessa. Käytä tätä muotoa tekstimuotoisten tiedostojen lataamisessa
FDM käyttää ASCII-muotoa määrättyjen tiedostotyyppien lataamiseen. Muut tiedostotyypit ladataan binääritilassa
Välityspalvelin
Välityspalvelimen asetukset
Hae asetukset Microsoft Internet Explorer -selaimelta
Määritä itse
Ei välityspalvelinta
Asetukset
Osoite:
Portti:
Anna välityspalvelimen osoite
Anna välityspalvelimen portti
FDM käyttää MSIE:n käyttämiä välityspalvelimen asetuksia
Määritä itse käytettävät välityspalvelinasetukset
FDM ei käytä välityspalvelinta
Valitse palvelintyypit, joiden kanssa haluat käyttää välityspalvelitna
Anna käytettävän välityspalvelimen osoite
Anna välityspalvelimen käyttämä portti [yleensä 3128, 1080 tai 8080]
Valitse tämä, jos välityspalvelin vaatii kirjautumisen
Muut asetukset
Paikellinen tiedosto
Jos tiedosto on jo olemassa:
Varaa latauksen tarvitsema levytila etukäteen
Lisää tiedostonimeen pääte keskeneräisiin latauksiin
Internet-palvelin
Älä käynnistä latausta uudelleen, jos palvelin ei tue latauksen jatkamista
Jos tiedoston koko on vaihtunut palvelimella:
Pysäytä virheen sattuessa
Kysy
Uudellenkirjoita
Uudelleennimeä
Jatka
Uudelleenkäynnistä
Mukaudu
Anna tiedostopääte
Täällä voit määrittää mitä FDM tekee, jos samanniminen tiedosto on jo olemassa tallennuskansiossa
Valitse tämä, jos haluat, että FDM varaa levyltä ladatun tiedoston vaatiman tilan aloitettaessa
Jos valittu, FDM lisää ladattavan tiedoston ylimääräisen tiedostopäätteen. Latauksen valmistuttua FDM nimeää tiedoston alkuperäiseksi
FDM ei aloita latausta uudelleen, jos palvelin ei tue latauksen jatkamista.
Täällä voit määrittää, mitä FDM tekee, jos tiedoston koko muuttuu palvelimella
Valitse tämä, jos haluat, että lataus keskeytetään, jos tiedostoa ei löydy palvelimelta
Valitse tämä, jos haluat, että lataus keskeytetään, jos käyttäjätunnus tai salasana eivät kelpaa
Kaistankäyttötilat
Valitse tila, jota haluat mukauttaa:
Yhteyksien kokonaismäärän yläraja:
Yhden palvelimen yhteyksien yläraja:
Kaistanrajoitus:
ei rajoitusta
Valitse kaistanrajoitustila, jota haluat mukauttaa
Valitse tämä, jos haluat rajoittaa FDM:n luomien yhteyksien maksimimäärää
Valitse tämä, jos haluat rajoittaa yhteen palvelimeen luotavien yhteyksien maksimimäärää
Määritä FDM:n tiedostojen latauksiin käyttämän kaistan määrä
Kaikki lataukset
Latauslista
Tallenna jokainen automaattisesti
min.
Kun poistetaan keskeneräistä latausta
Poista automaattisesti valmiit lataukset
Älä poista tiedostoa
Poista tiedosto
FDM tallentaa latauslistan automaattisesti tietyin väliajoin. Se suojaa listaa tietokoneen jumiutumiselta ja virtakatkoilta
Voit määrittää, mitä FDM tekee poistettaessa keskeneräistä latausta
Valitse tämä, jos haluat latauksen poistuvan listasta automaattisesti latauksen valmistuttua
Seuraaminen
Seuraa
Leikepöytä
Seuraa tiedostopäätteen mukaan
Ohitea tiedostopäätteen mukaan
ALT-näppäin ei saa olla painettu
ALT-näppäin täytyy olla painettu
Anna tiedostopäätteet
Valitse tämä, jos haluat, että FDM kaappaa Internet Explorerin lataukset
Valitse tämä, jos haluat, että FDM tarkkailee leikepöytää
Tarkkaile vain määrätyn tiedostopäätteen omaavia tiedostoja
Ohita määrätyn tiedostopäätteen omaavat tiedostot
Seuraa vain, jos ALT-näppäin ei ole pohjassa
Seuraa vain, jos ALT-näppäin on pohjassa
Käynnistys
Lataa käynnistymisen yhteydessä
Pienennä aloitettaessa
Järjestelmä
Pienennä tehtäväriville
Sulje-painike pienentää ikkunan
FDM käynnistetään Windowsin käynnistymisen yhteydessä
FDM pienennetän tehtäväriville käynnistymisen yhteydessä
Kun Pienennä-painiketta klikataan, FDM siirtyy ilmoitusalueelle
Jos valittu, Sulje-painike toimii kuten Pienennä-painike
Päivitä
Päivityspalvelimen osoite
FDM tarkistaa päivitykset automaattisesti
Verkonkäytön optimointivelho
Tervetuloa verkonkäytön optimointivelhoon!
Tämä velho auttaa sinua asettamaan optimaaliset asetukset yhteystyyppiisi nähden. Se vaikuttaa Lataimen asetuksiin ja latauksen oletusasetuksiin.
Valitse käytössäsi olevan yhteyden tyyppi
Valmis
Valitse Internet-yhteytesi tyyppi
Mukauta FDM toimimaan parhaiten yhteytesi kanssa
Tehtävät
Aloitusaika
Seuraava aloitusaika
Viimeinen aloitusaika
Ajoituslistaa ei voi ladada. Tiedosto voi olla vaurioitunut tai toisen prosessin käytössä.
Ajastimen lokia ei voi ladata.
Ajastimen listaa ei voi talentaa.
tehtävä "%s" on ajastettu. Aloitetaanko tehtävä?
Vaihdetaan kaistankäyttötilaksi "%s"
Katkaise yhteys
Kaikki yhteydet
Vaihda kaistankäyttötilaksi
Sammuta
Käynnistä uudelleen
Kirjaudu ulos
Kerran
Su
Ma
Ti
Ke
To
Pe
La
Päivinä:
Joka
päivää
tuntia
FDM:n käynnistyksen yhteydessä
Kun yhteyden muodostus onnistui
Kun yhteyden muodostus epäonnistui
Kun aktiivisia latauksia ei ole
Kun nopeus on pienempi tai yhtä suuri kuin %d bps %d aikana
Kun kaikki lataukset ovat virhetilassa aikana
Ei koskaan
Tuntematon
Yhteyden muodostus onnistui kohteeseen "%s"
Yhteyden muodostus epäonnistui kohteeseen "%s"
Aloitus onnistui
Muisti vähissä
Ei voi aloittaa
Ajastuksen suoritus aiheuttaa ohjelman sulkemisen käynnistyksen yhteydessä. Ajastustoimenpiteitä ei suoriteta
Suurin uudelleensoittojen määrä
Odotusaika yrityskertojen välillä
Sulje yhteys, jos nopeus on pienempi kuin:
Yritä uudelleen
Ei enmpää kuin
Käytä yhteyttä
Jos onnistuneesti
kertaa
Sulje kaikki aktiiviset yhteydet
Suljettava yhteys
Ohjelman nimi:
Lisäkomennot:
Sammutuksen tyyppi:
Pakota ohjelmat sammumaan
Suorita ohjelma
Muodosta puhelinverkkoyhteys
Sulje puhelinverkkoyhteys
Vaihda kaistankäyttötilaa
Sulje FDM
Sammuta tietokone
Aloitettavat lataukset
Pysäytettävät latatukset
Sovellukset
Kaikki tiedostot
Valitettavsti tämä ominaisuus on käytettävissä vain Windows 2000:n, XP:n ja niitä uudempien Windowsien kanssa
Anna ohjelman nimi
Valitse lataukset
Valitse kaistankäyttötila, jonka haluat tulevan valituksi latauksen käynnistyessä
Valitse tämä, jos haluat rajoittaa epäonnistuneen yhteyden muodostuksen uudelleenyrityskertoja
Odotusaika ennen uudelleenyrittämistä
Valitse tämä muodostaaksesi yhteyden, jonka nopeus ei ole pienempi kuin antamasi arvo
Määritä pienin sallittu yhteysnopeus
Valitse tämä, jos haluat, että FDM yrittää muodostaa yhteyden uudelleen
Valitse tämä, jos haluat rajoittaa epäonnistuneiden yhteydenottokertojen määrää
Määritä lataus//lataukset tässä
Käytettävissä olevat lataukset
Lisää lataus ajoitettujen latausten listaan
Poista valittu lataus ajoitettujen latausten listasta
Määritä ohjelma, jonka haluat suorittaa
Etsi suoritettava ohjelma
Määritä ohjelman parametrit
Määritä session sulkemistyyppi
Valitse tämä, jos haluat pakottaa session lopetuksen. Se on kätevä, jos sovelluksia on jumiutunut, mutta kaikki tallentamaton data menetään.
Määritä ajastettava tehtävä
Valitse tämä, jos haluat, että FDM sulkee kaikki aktiiviset yhteydet
Määritä katkaistava yhteys tässä
Tiettyinä päivinä
Sunnuntai
Maanantai
Tiistai
Keskiviikko
Torstai
Perjantai
Lauantai
Tapahtuma
Aikana
Alhainen nopeus:
min.
Minuutit
Tunnit
Päivät
Kun latausnopeus on liian alhainen
Kun kaikki lataukset ovat virhetilassa
Määritä päivät
Aloita tehtävä määrättynä ajankohtana
Anna tehtävän suoritusaika tähän
Suorita tehtävä tiettynä päivänä
Anna tehtävän suorituspäivämäärä tähän
Aloita tehtävä tiettynä viikonpäivänä
Aloita tehtävä joka sunnuntai
Aloita tehtävä joka maanantai
Aloita tehtävä joka tiistai
Aloita tehtävä joka keskiviikko
Aloita tehtävä joka torstai
Aloita tehtävä joka perjantai
Aloita tehtävä joka lauantai
Suorita tämä tehtävä toistuvasti
Tähän kenttään voit määritellä suoritusten aikavälin minutteina, tunteina tai päivinä
Suorita tehtävä, kun jokin tapahtuma suoritetaan
Määritä tapahtuman tyyppi tähän
Anna aikaväli tähän
Anna pienin sallittu nopeus tähän
Tehtävän suorittaminen vaatii käyttäjän varmistuksen
Odota vahvistusta
s.
Jos valittu, FDM varmistaa käyttäjältä tehtävän aloituksen
Jos valittu, FDM odottaa käyttäjän varmistusta tietyin aikavälein. Jos käyttäjä ei vastaa varmistukseen, tehtävä aloitetaan
Osoite:
Laaditaan ladattavien tiedostojen listaa...
Yhdistetään palvelimelle...
Yritetään Sivustonhallintaan tallennetuilla käyttäjätiedoilla...
Noudetaan tiedostolistaa palvelmelta...
Yhteys palvelimeen katkesi. Yritetään uudelleen
Rakennetaan listaa
Noudetaan tiedostojen kokoja ja päivämääriä
Tämän valitsimen käyttö voi nopeuttaa prosessia huomattavasti
Valitse tämä, jos haluat, että FDM kysyy tiedostojen koon ja päivämäärän HTTP-palvelimilta
Sivuston nimi
Yhteydet
Kirjautuminen
Ryhmä
Sivustojen listaa ei voi ladata. Tiedosto voi olla vaurioitunut tai toisen prosessin käytössä
Sivustojen listaa ei voi tallentaa.
Suurin sallitty yhteysmäärä:
Oletusryhmä saman palvelimen toiselle lataukselle
Käytetään passiivista FTP-tilaa
Anna sivuston nimi
Samanniminen sivusto on jo olemassa. Anna toinen nimi
Yhteyksien maksimimäärän on oltava enemmän kuin nolla
Valitse ryhmä
Anna sivuston nimi tähän
Valitse tämä, jos haluat rajoittaa palvelimeen otettavien yhteyksien maksimimäärää
Valitse tämä, jos haluat ryhmitellä tämän palvelimen lataukset automaattisesti
Varmista käyttäjältä
Älä kysy tätä uudelleen
Virhe kirjoitettaessa levylle
Tiedosto "%s" on jo olemassa. Miten toimitaan?
Älä kysy tätä kysymystä uudelleen. Tekemäsi valinta otetaan käyttöön automaattisesti
Korvaa samanniminen tiedosto
Nimeä lataus uudelleen
Jatka latausta (tiedoston alkua ei ladata uudelleen)
Keskeytä lataus
Kyllä
Ei
Lataa
poistettiin. Poistetaanko myös levyllä oleva tiedosto?
Anna käyttäjätunnus ja salasana
Kirjaudutaan: "%s"
Lähetä määrittämäsi käyttäjätunnus ja salasana palvelimelle
Älä yhdistä tähän palvelimeen
Tiedoston "%s" koko on muuttunut. Miten toimitaan?
Aloita lataus alusta
Mukauta lataus muuttuneeseen kokoon (ei-suositeltava vaihtoehto)
Odota
Päivitä
Kuvaus
Päivitä käyttäen:
Tarkistetaan päivityksiä...
Sinulla on uusin versio!
Ladataan
Version %s käännös %s on saatavana!
Täysi asennuspaketti versioon %s (%s)
Päivitä versioon %s
Päivitä versioon %s (%s)
Jotta muutokset tulisivat voimaan, FDM täytyy käynnistää uudelleen. Käynnistetäänkö FDM uudelleen nyt?
Päivitys valmis
Päivittäjää ei löydy
Anna päivityksen tyyppi tähän
Päivitä käyttäen täyttä asennuspakettia
Päivitä käyttäen päivityspakettia
Lisätietoja päivitysprosessista
Mitä uutta tässä versiossa on?
Aloita päivittäminen nyt
Keskeytä päivitys ja sulje ikkuna
Luo lataukset
Valitse sisältö
Poista sisällön valinta
Käytettävien latausten lista
Valitse haluamasi kohteet lisätäksesi ne latauslistaan
Poista haluamiesi kohteiden valinta poistaakseni ne latauslistasta
Tietoja ohjelmasta
Copyright (c)
Kaikki oikeudet pidätetään
Rekisteröity käyttäjä:
Ohjelma on jo päivitetty. Käynnistä ohjelma uudelleen
Virheellinen käyttäjätunnus tai salasana
Historiatiedostoa ei voi ladata
Historiatiedostoa ei voi tallentaa
HTML-spiderin oletusasetukset
HTML-spider
Internet-sivujen hakemistopolku
Lataa Internet-sivusto
Sivujen latausasetukset
Aloita lataaminen
Pysäytä lataaminen
Ajasta lataaminen
Poista
Avaa sivu Internet-selaimessa
Aloita lataaminen automaattisesti
Internet-sivun osoite
Tiedostot
Poista myös lataukset?
Internet-sivujen listaa ei voi ladata
Internet-sivujen listaa ei voi tallentaa
Sivun tai HTTP-palvelimen osoite, jolta haluat ladata
Sivun tai HTTP-palvelimen osotie, jolta lataus alkoi
Kansion nimi, johon lataukset tallennetaan
Tallennuskansio:
Intenet-sivut
Sivut
HTML-muotoisten sivujen tiedostopäätteet
Lataa sivujen tyylitiedostot
Lataa sivuja muiltakin palvelimilta
Kuvat
Lataa kuvat
Lataa kuvat muille palvelimille linkitetyt kuvat
Latauksen syvyys:
Tiedostopäätteet Internetsivuille, joiden sisältö on HTML-muotoinen. Sivut skannataan linkkien ja kuvalinkkien lataamiseksi
Jos valittu, myös Internet-sivujen tyylitiedostot (.css) ladataan. Suositeltava
Jos ei valittu, web pages of other sites will not be downloaded. Esimerkiksi: jos ladattava sivu sijaitsee palvelimella http://palvelin.fi/ sivu http://palvelin.fi/sivu.html ladataan, mutta sivua http://serveri.fi/sivu.html ei ladata, vaikka siihen olisi alkuperäisellä sivulla linkki
Jos valittu, myös Internet-sivuilla näytettävät kuvat ladataan
Jos ei valittu, Internet-sivuilla näytettäviä kuvia, jotka sijaitsevat eri palvelimella kuin itse sivu, ei ladata
Linkkien seurantasyvyys. Esimerkiksi: lataat sivua http://servo.fi/sivu.html, jolla on linkki sivulle http://servo.fi/sivu2.html, jolla on edelleen linkki sivulle http://servo.fi/sivu3.html. Sivun http://servo.fi/sivu3.html syvyysarvo on 3, eikä sitä ladata, jos syvyysarvo on pienempi kuin kolme. Sivu http://servo.fi/sivu2.html kuitenkin ladataan, sillä sen syvyysarvo on kaksi.
Lataa tiedostot Internet-sivuilta
Lataa tiedostot myös muilta palvelimilta
Tiedostojen ohittaminen tiedostopäätteisesti
Päälle
Lataa
Älä lataa
tiedostoja, joiden pääte on
Jos valittu, myös Internet-sivuilla olevat tiedostolinkit ladataan
Jos valittu, myös muilla palvelimilla olevat linkitetyt tiedostot ladataan
Jos valittu, määritetyn tyyppisiä tiedostoja ei ladata
Jos valittu, tiedostot, joiden pääte on listattu alapuolella, LADATAAN
Jos valittu, tiedostoja, joiden pääte on listattu alapuolella, EI LADATA
Vie asetukset
Tuo asetukset
Ohjelman Regedit.exe suorittaminen epäonnistui
Virhe vietäessä asetuksia
Virhe tuotaessa asetuksia
FDM rekisteritiedostot
Kuvien ohitus tiedostopäätteittäin
kuvat, joiden pääte on:
Jos valittu, kuvia, joiden tiedostopääte on listattu, ei ladata
Jos valittu, kuvat, joiden pääte on listattu alapuolella, LADATAAN
Jos valittu, kuvia, joiden pääte on listattu alapuolella, EI LADATA
Älä lataa ja poista
Palvelin ei tue latauksen jatkamista. Aloitetaan alusta.
Osoiteen avaaminen epäonnistui!
Tuntematon virhe kirjoitettaessa järjestelmärekisteriin
Kiitos rekisteröinnistä! Ole hyvä ja käynnistä FDM uudelleen.
Lataa FDM:llä
Lataa sivusto FDM:llä
Lisää FDM Internet Explorerin pudotusvalikkoon
Valitse tämä lisätäksesi "Lataa FDM:llä" ja "Lataa sivusto FDM:llä" Microsoft Internet Explorerin pudotusvalikkoon (hiiren kakkospainike)
Pienennä liikennettä muun liikenteen yhteydessä
Aseta seuraavaksi pienempi tila
Aseta pienin tila
Valitse tämä vähentääksesi FDM:n käyttämää kaistaa, kun muut ohjelmat käyttävät yhteyttä. Tämä mahdollistaa sulavamman Internet-selaimen käytön FDM:n ladatessa tiedostoja
Kaistankäyttötilaa lasketaan yhdellä pykälällä (Täysi->Kohtalainen, Kohtalainen->Pieni)
Kaistanköyttätilaksi asetetaan Pieni
Kelpaa
Kelpaa aladomaineille
Valitse tämä, jos haluat tätä tallennetta käytettävän HTTP-latauksissa
Valitse tämä, jos haluat tätä tallennetta käytettävän HTTPS-latauksissa
Valitse tämä, jos haluat tätä tallennetta käytettävän FTP-latauksissa
Valitse tämä, jos haluat käyttää tätä tallennetta kaikille palvelimen alapalvelimille. Esimerkiksi: palvelimelle http://servo.fi käytettävää tietoa käytetään myös palvelimen http://alempi.servo.fi yhteyksissä
Valitse ainakin yksi protokolla
Yhtäaikaisten latausten suurin määrä
Valitse tämä, jos haluat asettaa ylärajan yhtä aikaa suoritettavien latausten määrälle
Lataa uudelleen
Luo yksi uusi latausosa
Pysäytä yksi latausosa
; context: [section x] - Stopped
Pysäytetty
; tray menu
Pudotusvalikko
;
Opera-selaimen plugin-kansiota ei löydy! Haluatko määrittää sen itse?
Netscape-selaimen plugin-kansiota ei löydy! Haluatko määrittää sen itse?
Opera-seurantaa ei voi asettaa
Opera-seurantaa ei voi poistaa
Netscape-seurantaa ei voi asettaa
Netsecape-seurantaa ei voi poistaa
Valitse tämä, jos haluat, että FDM käsittelee Operan tiedostolataukset
Valitse tämä, jos haluat, että FDM käsittelee Netscapen tiedostolataukset
; create download dlg
Tiedostokoko?
; request a size of a download
Kysytään...
Kysy tiedoston koko palvelimelta
Kyllä kaikkiin
Ei kaikkiin
Tarkennettu loki
Jos valittu, FDM näyttää kaikki palvelimen vastaukset
Muutokset tulevat voimaan selaimen uudelleenkäynnistämisen jälkeen
Tehtävälista
Tiedostolista
Sivustolista
Sivulista
Poistetaan latauksia
Luodaan latauslistaa
Luo ajastettu lataus
Mistä:
Mihin:
Askel:
Sarjamerkit:
Tulokset
Näyte:
Sarjan aloitusnumero
Sarjan päätösnumero
Sarjan asekeleen suuruus. Esimerkiksi: jos arvo on 10, sarja on 0, 10, 20, 30...
Sarjamerkkien määrä. Esimerkiksi: jos arvo on yksi, sarja voi olla 0, 1, 2, 3... Jos arvo on kaksi, sarja voi olla 00, 01, 02...
Klikkaa tästä katsellaksesi luotua sarjaa
Anna Internet Explorerin ladata, jos painat Peruuta
Valitse tämä, jos haluat antaa latauksen takaisin Internet Explorerille painaessasi Peruuta-nappia Uusi lataus -ikkunassa
Sarjan päätösnumeron on oltava suurempi kuin aloitusnumeron
Käytä tähteä (*) osoitteessa määrittääksesi mallitiedoston
Luo tiedostopääte, jos tiedostolla ei sellaista ole
Valitse tämä luodaksesi määrätyn tiedostopäätteen tiedostoille, joilla ei sitä ole. Esimerkiksi: jos tiedoston nimi on "asiakirja" ja määrittelemäsi tiedostopääte on "txt", tuloksena olisi "asiakirja.txt". Tiedostopääte BAK on melko turvallinen vaihtoehto.
Näytä koko aina tavuina
Valitse tämä, jos haluat näyttää kaikki koot tavuina kilotavujen tai megatavujen sijaan
Suoria virustarkastus
Määritteet:
Tiedostopäätteet:
Valitse tämä, jos haluat suorittaa ladatuille tiedostoille automaattisesti virustarkastuksen
Anna virustentorjuntaohjelmiston nimi tähän
Anna virustentorjunnassa käytettävän ohjelman vaatimat määritteet tähän
Anna ne tiedostopäätteet, joille haluat suorittaa automaattisen virustarkastuksen
Anna virustentorjuntaohjelmiston nimi
Nimi ei kelpaa, tarkista nimi
Suoritetaan virustarkistusta...
Pysäytä tehtävä suorittamisen jälkeen
Poista tehtävä suorittamisen jälkeen
Valitse tämä, jos haluat automaattisesti pysäyttää tehtävän suorituksen jälkeen
Valitse tämä, jos haluat automaattisesti poistaa tehtävän suorituksen jälkeen
Mene
Takaisin
Luo tiedostonimi automaattisesti
Valitse tämä, jos haluat että ladattava tiedosto nimetään automaattisesti
Tallenna päätteellä "htm"
Valitse tämä, jos haluat tallentaa kaikki Internet-sivut "htm" -päätteellä
Valitse tämä, jos haluat laskea kaikkien latausten koon yhteen
Säilytä palvelimen hakemistorakenne
Valitse tämä, jos haluat säilyttää palvelimen alkuperäisen hakemistorakenteen. Muulloin kaikki ladatut tiedostot tallennetaan yhteen hakemistoon
Olet valinnut toisen kansion. Asetetaanko tämä kansio ryhmän oletustallennuskansioksi? Voit vaihtaa oletuskansion ryhmän asetuksissa
; === ADDED LINES ===
Lataus, jolla on sama osoite, on jo olemassa. Mitä tehdään?
Suorita
Suorita ladattu tiedosto
Versio
Ota yhteyttä tekijöihin
Lataa viimeisin versio
Varoitus: Tämä tietokoneohjelma on suojattu tekijänoikeuslaulla ja kansainvälisillä sopimuksilla. Ohjelman tai sen osan luvaton tuottaminen tai jakelu saattaa johtaa oikeudellisiin toimiin ja korvauksiin lain sallimiin maksimirangaistuksiin asti.
; === new version ===
Lataa kaikki FDM:llä
Lisää latauslista
Poista valitut
Tässä on lista lisättävistä osotteista
Klikkaa tästä poistaaksesi kaikki valinnat listasta
Firefox-selaimen plugin-kansiota ei löydy! Haluatko määrittää sen itse?
Firefox-seurantaa ei voi asettaa
Firefox-seurantaa ei voi poistaa
Valitse tämä, jos haluat, että FDM käsittelee Mozilla Firefoxin tiedostolataukset
Lataus valittu FDM:n toimesta
Aloitetaan...
Sivustot
Aktiiviset lataukset
Aktiivisia latauksia ei tällä hetkellä ole
Huomautukset
Käytä ilmoitusrivin puhekuplia
Viive
Valitse tämä, jos haluat, että puhekupla ilmoittaa keskeytyneestä tai päättyneestä latauksesta. Huom! Tämä toimii vain Windows 2000 -käyttöjärjestelmästä eteenpäin!
Sulkee puhekuplan tietyn ajan kuluttua
Lähteet
Automaattinen peilipalvelimien etsiminen
Peilipalvelimien maksimäärä
Laske peilipalvelimien nopeus
Laske nopeus joka...
Valitse tämä, jos haluat suorittaa uuden latauksen yhteydessä haun palvelimista, joilta voi ladata samaa tiedostoa
Rajoita käytettävien peilipalvelimien määrää. Tämä vähentää nopeuden uudelleenlaskentaan kuluvaa aikaa
Valitse tämä, jos haluat määrittää kunkin peilipalvelimien nopeuden hitaiden palvelimien karsimiseksi
Suorittaa peilipalvelimien nopeuksien laskennan tietyin väliajoin
Älä suoria hakua, jos koko on alle
Hakua ei suoriteta, jos ladattavan tiedoston koko on alle asetetun rajan
Älä suorita hakua, jos tiedostokoko on tuntematon (Suositus!)
Lisää peilipalvelin
Etsi peilipalvelimia
Lisää peilipalvelin tälle lataukselle manuaalisesti
Etsi peilipalvelimia FileSearching.com -palveun avulla
Peilipalvelimien osoitteet
Nopeus
Käytössä
Mittaa peilien nopeus
Mittaa peilipalvelimien nopeus
Latausten tiedot
Odotetaan...
Peililatauksen osoite
Tiedostokoko on yli 2Gt. Vain FTP-protokolla pystyy käsittelemään tällaiset lataukset!
;
;
; #NEW LINES (BUILDS NEWER THAN 195)#
;
;
; BEGIN: New Download page
Uusi lataus
Määritä latauksen ryhmä automaattisesti
Ryhmä:
Tallenna lataus ryhmämääritteiseen kansioon
Valitse tämä, jos haluat, että lataus ryhmitellään automaattisesti tiedostopäätteen tai sivuston asetusten mukaan.
Aseta ryhmään manuaalisesti
Valitse tämä, jos haluat tallentaa latauksen automaattisesti ryhmän oletushakemistoon (katso Ryhmien asetukset)
Aseta oletuslatauskansio manuaalisesti
; END
; BEGIN: Monitoring page
Taustalla seuraaminen
Jos valittu, "Uusi lataus" -ikkunaa ei näytetä kaapattaessa lataus selaimelta
Mukauta
Valitse Internet Explorerin pudotusvalikossa näytettävät kohteet
; END
Valitse näytettävät valikkokohteet
Ainakin yksi kohde täytyy olla valittuna!
Käytä ääniä
Valitse tämä, jos haluat, että FDM toistaa äänitiedoston tiettyjen tapahtumien merkiksi (esim. lataus suoritettu loppuun)
Valitse ääni kullekin tapahtumalle
; BEGIN : Customize sounds dialog
Mukauta ääniä
Aseta ääni
Poista
Toista
Lista FDM:n tapahtumista ja vastaavista äänistä. Täällä voit asettaa FDM:n toistamaan äänen tiettyjen tapahtumien tapahtuessa
Lataus lisätty - toista ääni, kun lataus lisätään onnistuneesti latauslistaan
Lataus valmis - toista ääni, kun lataus on onnistuneesti suoritettu loppuun
Lataus epäonnistui - toista ääni, kun lataus on jostain syystä keskeytynyt tai epäonnistunut
Soittaminen onnistui - toista ääni, kun Ajastimeen määritetty yhteyden muodostaminen soittosarjan avulla onnistui
Soittaminen epäonnistui - toista ääni, kun Ajastimeen määritetty yhteyden muodostaminen epäonnistui
Valitse tapahtumaan liitettävä ääni
Älä toista ääntä tapahtuman kohdalla
Kokeile valittua ääntä
Tapahtuma
Äänitiedosto
Ei ääntä
Lataus lisätty
Lataus valmis
Lataus epäonnistui
Soittaminen onnistui
Soittaminen epäonnistui
Äänitiedostot
; END
Etsitään peilipalvelimia...
Mitataan peilipalvelimien nopeutta...
Peilipalvelimien haku on jo suoritettu
Yhdistetään hakupalvelimelle...
Luetaan vastausta...
Peilipalvelimia löytyi %d kpl
Peilihaku päättyi
Kokeillaan toista palvelinta...
Peilipalvelimia ei löytynyt
Epäonnistui
Peilipalvelimien nopeus on mitattu
; BEGIN: History page
Historia
Tallenna linkkien ja kansioiden historia
Tallenna vain kansioiden historia
Säilytä merkinnät
Suurin merkintöjen lukumäärä:
Tyhjennä historia
FDM tallettaa käyttämiesi kansioiden ja tiedostojen käyttöhistorian
FDM tallettaa vain kansioiden käyttöhistoriat
FDM poistaa automaattisesti historiasta merkinnät, jotka ovat vanhentuneet
Historiamerkintöjen suurin sallittu määrä. Kun raja-arvo saavutetaan, FDM poistaa vanhimman latauksen merkinnät.
Poistaa kaikki merkinnät käyttöhistoriasta
; END
Tuo
Vie
Tuo osoitteiden lista
Vie latausten lista
Tekstitiedostot
Tiedostoa ei voi avata
Vie kaikki lataukset
Vie kaikki lataukset listalta
Vie valitut lataukset
Älä vie valmiita latauksia
Jatka tiedostoa, jos se on jo olemassa
Epäkelpo ryhmänimi. Älä käytä merkkejä \ ja /
Sulje, kun lataukset ovat valmiit
; BEGIN : Downloads History window
Lisätty
Tallennuskansio
; END
Roskakori
; BEGIN: Recycle Bin
Ominaisuudet
Tyhjennä roskakori
;END
;BEGIN: Recycle Bin properties
Älä siirrä poistettuja latauksia roskakoriin
Pidä enintään
latausta
Älä säilytä valmiita latauksia
Kysy varmistus latauksia poistettaessa
Roskakorin ominaisuudet
Valitse tämä, jos et halua käyttää roskakoria, vaan poistetut lataukset hävitetään välittömästi
Valitse tämä, jos haluat rajoittaa roskaskorissa olevien latausten maksimimäärää
Suurin latausten määrä roskakorissa
Valitse tämä, jos et halua siirtää valmiita latauksia roskakoriin niitä poistettaessa, vaan että ne tuhotaan välittömästi
Valitse tämä, jos haluat, että FDM kysyy sinulta vahvistuksen latausta poistettaessa
;END
Jatka
Jatketaan latauksia...
; History subitems
Tänään
Eilen
Viikon sisällä
Kuukauden sisällä
Valitse...
; end
Tyhjennä historia
Tallenna lataushistoria
Tallenna historiamerkinnät vain valmiista latauksista
Check this button if you want to save history of your downloads
Check this button if you want to store history of completed downloads only
Latausten historiamerkinnät
Laaditaan historiamerkintälistaa...
; Download Was deleted
Poistettiin
Valitse aikaväli
Etsi
Etsi seuraava
Mitä etsitään
; BEGIN : Find dialog
Hakukohteet
Paikalliset tiedostonimet
Määritä tähän, mitä haluat etsiä
Etsi osoitteen tiedostonimestä
Etsi koko osoitteesta
Etsi latausten kommenteista
Etsi latausten tallennusnimistä ja hakemistoista
Määritä haun lisävalinnat
; ADVANCED settings
Hakukohteet
Etsi latauslistasta
Etsi lataushistoriasta
Etsi tietyn aikavälin latauksista
Aseta
Etsi roskakorista
Etsi tietyn kokoisista tiedostoista
Pienin koko
Suurin koko
Etsi nykyisten latausten listasta
Etsi latausten historiamerkinnöistä
Etsi vain niistä latauksista, jotka osuvat halutulle aikavälille
Aseta aikaväli
Etsi roskakorista
Etsi vain niistä latauksista, joiden koko osuu halutulle välille
Pienin tiedoston koko, joka hyväksytään etsintään
Suurin tiedoston koko, joka hyväksytään etsintään
Etsi ryhmästä
Valitse ryhmä, josta etsitään
; END
Etsitään latausta...
Ei osumia.
Uusia osumia ei löytynyt.
Etsintä valmis
Kopioi osoite leikepöydälle
ZIP-esikatselu
Ainakin yhden tiedoston tulee olla valittuna
Lataus saattaa olla ZIP-paketti. Haluatko yrittää esikatselua?
Äänen/videon esikatselu
Tiedoston avaaminen epäonnistui
Tuntematon mediatyyppe
Tämä ominaisuus vaatii DirectX:n version 8 tai sitä uudemman. Lataa viimeisin DirectX-versio osoitteesta http://www.microsoft.com/directx
Leikkeen tiedot
Koko:
Käytettävissä:
Kesto:
Vaimenna
Toista
Pysäytä
Suodatin
Päätteet (välilyöntierotteisesti, esim "rar arj zip")
Poista määrätyn tyyppiset tiedostot
Poista muut kuin määrätyn tyyppiset tiedostot
Määrityskenttä ei sisällä %file% (tiedostonimi) -makroa. Tämä tieto on välitettävä virustutkalle, jotta se tietäisi mikä tiedosto tutkia.
Jatketaanko kuitenkin?
Varoitus
Aseta "piilotettu" -lippu keskeneräiselle lataukselle
Lisää kommentti tiedostonimeen latauksen valmistuttua
Älä tallenna palvelimen sivuja
Valitse tämä, jos et halua tallentaa itse sivuja, vaan ainoastaan tiedostot ja kuvat
Käytä ZIP-esikatselua
Valitse tämä, jos haluat esikatsella paketin sisältöä latauksen alussa, jos haluat ladata vain osan paketista.
Paketti:
Aloita lataaminen automaattisesti
Valitse tämä, jos haluat, että FDM aloittaa uudet lataukset ilman käyttäjän vahvistusta
Valitse ladattavat tiedostot
Aseta ladattavalle tiedostolle peilipalvelimet
Älä käytä esikatselua jatkossa
ZIP-esikatselu on poistettu käytöstä. Jos haluat sen päälle, mene Asetukset -> Latausasetukset (Ctrl+O) -> Uusi lataus -välilehti ja aseta ruksi kohtaan "ZIP-esikatselu"
Ohituslista
Lista sivuista, jotka ohitetaan ladattaessa sivustoa.
Alikansiot
Lisää
Ohita myös kaikki alikansiot
; Proxy tab new settings
Käytä takautumaa rikkoutuneissa yhteyksissä
Takautuman koko
tavua
Valitse tämä, jos haluat ottaa takautuman käyttöön. Tämä valinta auttaa ehkäisemään vaurioituneita latauksia.
Size of rollback. Greater size will allow rollback to work more safely. Recommended size is 3000 bytes. You may increase this value if your downloads still remains damaged.
; downloader options -> monitor tab
Älä kaappaa pienempiä latauksia kuin
Valitse tämä, jos haluat, että FDM ei kaappaa latauksia, jotka ovat kooltaan pienempiä kuin määritetty arvo
Kt
Roskakorissa on liikaa kohteita! Tämä saattaa hidastaa ohjelman toimintaa huomattavasti! Haluatkä tyhjentää roskakorin nyt?
Älä tarkista tätä uudelleen
Varoitus! Lataushistoriassa on liikaa kohteita! Tämä saattaa hidastaa ohjelman toimintaa huomattavasti! Haluatko tyhjentää lataushistorian nyt?
Palvelimen tukea latauksen jatkamiselle ei tiedetä, koska palvelimen vastaus oli epäkelpo.
Kopioi leikepöydälle
; general settings | skins page
Teemat
Teema
Käytä teeman kuvakkeita
Käytä teeman bittikarttoja
; default skin
<default>
Huom! Muutokset tulevat voimaan uudelleenkäynnistyksen jälkeen!
Näytä latauksen tiedot ladattaessa
Ohita tiedostot, joiden pääte on
Ohita ne tiedostot, joiden tiedostopääte on listassa
Ei aktiivisia latauksia
Toista ääni, kun kaikki lataukset ovat valmit
Tuo osoitelista leikepöydältä
Salasanat
Sivustonhallinnan asetukset
; Save password dialog
Tallenna salasana?
FDM voi tallentaa tälle palvelimelle käytetyn salasanan, jotta sitä ei tarvitsisi joka kerta syöttää uudelleen käsin.
Tallennetaanko tämä salasana?
Älä tallenna salasanoja
; Site Manager options | Passwords tab
Käytä sivustonhallintaa salasanojen tallennukseen
Kysytäänkö salasanojen tallennusta vai ei
Älä ehdota salasanojen tallentamista
Poista kaikki salasanat poistuttaessa
Poista kaikki salasanat
; create new HTML Spider task
Poista valmiit lataukset automaattisesto (suositus)
Valitse tämä, jos haluat poistaa valmiit HTML-spider-lataukset. Tämä nopeuttaa suurten sivustojen lataamista.
Muutokset tulevat voimaan ohjelman uudelleenkäynnistämisen jälkeen.
Uusi tyyli
Vanha tyyli
Kansion nimi ei kelpaa
Piilota ponnahdusikkunat koko ruudun tilassa
Valitse tämä, jos haluat piilottaa kaikki ponnahdusikkunat koko ruudun tilassa työskenneltäessä.
ajastettiin suorittamista varten.
Haluatko suorittaa sen?
Suorita ladattu tiedosto, kun se on valmis
Käytä merkkejä (*) (*A) tai (*a) määrittääksesi osoitteen rungon
Peilihakupalvelin:
Lepotila
Valmiustila
Muista valinta
Ehdota ryhmän oletuskansion vaihtoa
Tallenna tiedosto
Avaa tiedosto
Tallenna ja avaa tiedosto
Latauksen tyyppi:
Linkitä FDM:ään
Linkitä Free Download Manager -ohjelmaan
Arvoisa käyttäjä,
Free Download Manager on ilmainen ohjelma. Voit käyttää sitä maksutta niin kauan kuin haluat.
Jos Free Download Manager on mielestäsi hyödyllinen ohjelma, ja sinulla on kotisivut, pyydämme, että mainostaisit ohjelmaa kotisivuillasi.
Kiitos avustasi jo etukäteen,\nFree Download Managerin kehitystiimi
Muistuta minua kolmen päivän kuluttua
Muistuta minua seuraavalla käynnistyskerralla
Älä näytä tätä ikkunaa uudelleen
Näytä linkin HTML-koodi
Linkin HTML-koodi
Lisää esimerkkejä
Kopioi leikepöydälle
Piilota
; "Traffic usage mode has beed changed" window
Kaistanköyttötilaa on vaihdettu!
Olet vaihtanut kaistankäyttötilaa.\nFree Download Managerissa on kolme eri kaistankäyttötilaa:
Tämä tila sallii FDM:n käyttää yhteyden tarjoamaa kaistaa kokonaisuudessaan. Tämä on aggressiivisin vaihtoehto.
Tämä tila sallii FDM:n käyttää yhteyden tarjoamaa kaistaa osan ajasta. Tämä tila sallii sekä sulavan Internetin selailun, että kohtalaisen nopean latauksen.
Tämä tila sallii FDM:n käyttää vain osaa yhteyden tarjoamasta kaistasta. Tämä tila mahdollistaa lataukset ilman, että verkko kuormittuu huomattavasti.
;
Nimeä uudelleen myös uudelleenkäynnistettäessä
Enter a value less than %d
; export/import downloads
URL List Files
Downloads Information List Files
;
Export options
;
Set the date of a file identical to the date specified by the server
Set the same date of a downloaded file as the one on the server
Generate description file
Generate a file with the name "*.dsc.txt" (* - name of a downloaded file) that will contain a small description of a downloaded file (comments + url + date). This file will be generated only for a download that has comments.
This file has been downloaded from
Don't retrieve the file date from the server
This option allows you to increase the speed of starting an FTP download. Free Download Manager will use SIZE command instead of LIST.
Don't save logs of downloads
Enabling this option will make Free Download Manager start and shut down faster and will decrease memory usage.
;
Export history of downloads
Export all entries
Export all entries on the list
Export selected entries
Export entries about completed downloads only
;
HTML Files
;
Free Download Manager Downloads History
URL of download
Downloaded to file
Size of file
Download was completed
Download was deleted
;
Saved in
File size
Resume support
Close this dialog when download is completed or stopped
Open
Do you want to see this window again?
Yes, but temporarily hide progress window for this download
No, don't show such progress windows for any download
Yes, but don't show progress window for this download
Using the SHIFT key means that this download will be deleted from disk and you will not be able to restore it.\nAre you sure?
Choose group
Set groups' root folder
Select groups' root folder.\nChanges will be applied to new downloads only.
Recent downloads
(empty)
Pause all downloads
Show downloading progress window
If checked, FDM will create a special window with information about downloading for each running download
; general settings | misc page
Timeouts for confirmations
Launch download
Ask for shutdown type
Confirmation timeout for "Tools | Hang-up when done" command.
Confirmation timeout for "Tools | Exit when done" command.
Confirmation timeout for "Tools | Shutdown computer when done" command.
Confirmation timeout for launch downloaded file when download is completed.
If checked, FDM will ask you for the type of shutdown for "Tools | Shutdown computer when done" command.
Don't ask for confirmation
; 5 seconds, 10 seconds, ...
%d seconds
Wait for my confirmation
Ignore pages from this folder
Download pages from this folder only
Including subfolders
Ignore all web pages located in this folder.
Download pages located in this folder only and ignore other web pages.
Check this option if you want HTML Spider to ignore (or download only) pages located in all subfolders of the specified folder.
Here you should specify URL of the folder.\nExample: "http://site.com/docs/".
Type
Ignore
Only
Set of numbers
Assign
Here you should specify the set of numbers for batch list.\nEx. 1-100, or 1-100s2w3.
Click this button to assign the set of numbers using the dialog window.
Single number
Number
Assign set of numbers
Syntax error
Extract archive
Extract
Extraction
Destination folder
Failed to extract. File format is unknown.
Traffic downloaded this month\n(%s was downloaded in the previous month)
Total speed of downloading
Disable Tools | "when done" task after execution
When enabled, any Tools | "when done" task will be automatically disabled after execution. Therefore, it will be launched only once.
; %s
; 1st - file name
; 2nd, 3rd - file info (size + date).
"%s" file already exists.\n\nDo you want to replace it\n(%s)\n\nwith the new one\n(%s)?
Yes for all
Skip
Skip all
Archive format is unknown
Visit web site
Install pack
By default, FDM supports ZIP, RAR and ARJ archives only.\nYou can extend the list of supported archives by installing additional archive support pack for Free Download Manager (Internet connection is required).
FDM archive support pack
Move up
Move down
Move selected download(s) up
Move selected download(s) down
Check file integrity
Some web sites provide special checksums for files available to download in order to allow users to make sure that the downloaded file is not damaged. You can enter this checksum here and FDM will check the file integrity.
Algorithm
Checksum
Paste from clipboard
Check
Calculating downloaded file's checksum...
File integrity check succeeded
File integrity check failed
File integrity check has been completed successfully.\nThere are no errors found in the downloaded file.
File integrity check has been completed.\nThere are errors found: the file was damaged during the downloading process. It is required to restart the downloading from the beginning.
Don't show this window again if check succeeds
Unable to find the executable file of the antivirus program you've chosen.\nPlease specify it yourself.
Files' sizes are not equal
Save as:\n(Sample: file(*)(*A)(*a).txt)
Invalid save as template specified.\nMake sure it corresponds to the URL template.
When done
When done (all completed or in error)
Applications
What's This?
Opinions
;
Dear all!
Free Download Manager (FDM) is one of the most popular downloading applications in the world, having millions of active users, but now, when it has become social, we want more!
If you find it as useful and must-have tool as we do, we kindly ask you to help us spread the word by posting a link to it in your blog, website or personal space, such as Myspace/MSN.
; %s will be replaced with "FDM buzz" 
Official %s has been started on August 16, 2006. Our goal is to make FDM the fastest-spreading Internet utility after FireFox!
FDM buzz
; %s will be replaced with "blog" 
You can track FDM's progress in our %s.
blog
Thanks for your help in advance,\nthe Free Download Manager development team
Don't show me this window again, I have a good memory.
Join the buzz
No, thank you
FDM Community
Switch to "Opinions" after download
If enabled, "Opinions" tab will be automatically activated when download is finished.
Modify Internet Explorer's network identification
If enabled, this will instruct web sites you browse that Free Download Manager is installed on your program. However, using this option may result in blocking of some sites.
Malicious?
Check if any of Free Download Manager's users reported this download as containing virus/adware/spyware/etc.
OK, none of Free Download Manager's users reported this download as malicious.\n\nHowever, this does not guarantee that this download is not malicious and it is recommended to check it using some antivirus program.
; keep all %xxx, \n as is.
There are %d of %d of Free Download Manager's users reported that this download is malicious.\nThe average rating for this download is %.*g.\n\nShow opinions about this download?
Check each new download before downloading if it is malicious
Use this option to get FDM check automatically, before downloading, if any of users reported this download as malicious.
Display opinions when downloading
If enabled, FDM will activate "Opinions" tab automatically and show opinions about download when downloading.
Checking if download is malicious (see options to disable this)
OK, nobody reported that it is malicious
Warning! Somebody reported that this download is malicious
Close
Loading
Don't download this
Cache the operations of writing the downloaded data to disk
If enabled, FDM will use internal cache buffer with the size you specified for operations of writing the downloaded data. This will reduce the number of times your HDD is used. This may increase the speed of downloading for high-speed connections.\nHowever, because downloaded data is not written to HDD immediately, it will be required to re-download this data again if a computer failure occurs (at worst, you will have to re-download as much data as you specified for the cache size).\nRecommended for high-speed connections.
Can't install SeaMonkey (Mozilla Suite) monitoring
Can't uninstall SeaMonkey (Mozilla Suite) monitoring
Check this box if you want FDM to catch clicks in Mozilla Firefox browser
Check this box if you want FDM to catch clicks in SeaMonkey (Mozilla Suite) browser
Allow the browser to download if you press Cancel
Check this box if you want your browser to download file when you press Cancel in the "Create download" dialog
Add FDM to the browser context menu
Check this box to add items "Download with FDM" and "Download web site with FDM" to the browser context menu (menu appears at right click)
Select menu items to display in browser context menu
Can't install Firefox monitoring
Move files to folder
Speed is too low. Restarting section...
Restart if speed is too low during (in min):
Restart section if downloading speed decreases dramatically.
Would you like to see such download progress windows again?
Sorry, this service is currently unavailable. Please try again later.
Move top
Move bottom
Place download at the top of the list
Check this option if you would like the download to be placed at the top of the list of downloads.
Monitoring in Firefox browser can't be enabled because FlashGot extension is installed.\nYou should uninstall FlashGot first.
Enable
Disable
Switch
If the Pause all downloads mode is enabled, it will be disabled, otherwise it will be enabled.
Official %s will be started on August 16, 2006. Our goal is to make FDM the fastest-spreading Internet utility after FireFox!
Automatically download and install updates
Notify me only when update is available
Turn off automatic updates
Now monitoring is enabled in %s.
Delete record
OK to delete?
There is no write access to Free Download Manager's folder.\nYou should grant write access in order to allow Free Download Manager to save its data files, otherwise all data will be lost after the restart of Free Download Manager.
This small box allows you to drag&drop links from your browser into Free Download Manager.\nIt allows to quickly show or hide Free Download Manager's window with a left button double click.\n\nIn order to hide it, right click on it and uncheck "Drop box" menu item.
Free Download Manager's Drop box
Disable all notifications for batch downloads
Check this options in order to disable all (balloon, sounds) notifications for downloads created by "%s" command.
Skip list
Specify the list of files extensions and the list of sites that should not be monitored.
Don't catch download from these sites (space separated):
Free Download Manager will not monitor downloads from the sites specified in this list. Specify domain names here (e.g. "site.com"). You may use '*' symbols.
Warning!\nAn error occurred while trying to perform virus check.\nWould you like to launch downloaded file anyway?
Integrity
Perform the integrity check when file is downloaded
In order to perform the integrity check Free Download Manager should know the valid checksum of the file. In most cases you should provide it for each download.
If the check failed
Valid checksum of this file
Do nothing
Specify here what FDM should do when the integrity check fails.\nAsk - FDM will ask you what to do.\nRestart - FDM will restart this download from the beginning.\nDo nothing - FDM will add the record about fail check to the downloading log file and will not do anything more.
Performing integrity check...
Integrity check succeeded.
Integrity check failed!
Specify integrity check algorithm.
Valid checksum
Result checksum
; zip preview window
Check/uncheck all
; group's properties dialog
Macroes
name of the server (e.g. "freedownloadmanager.org")
path to the downloading file on the server
current year
current month (number from 1 to 12)
current day
; don't translate "%year%-%month%-%day%" here
equivalent to "%year%-%month%-%day%"
;
From Mozilla Firefox
FDM will take proxy settings from Firefox
; new download settings
Use this group
; Downloads -> Schedule ->
Start
Stop
Schedule download start
Schedule download stop
;
; downloads that are not completed or have been completed recently
Not completed+Recent
Parent group
;
; create new download dialog -> set output folder as default dialog
Set as default for all the groups of downloads
; %s - place of name of the group. don't change this
OK to set this folder as the default output folder for the "%s" group?
;
;
Clean up the list of the downloads
Uploads
Upload files
Start uploading
Stop uploading
Schedule uploading
Move selected upload(s) up
Move selected upload(s) down
Uploaded
List of uploads
Retrieving destination upload URL from the base server...
Abort
; outlook express: view | insert file | ...
As attachment
As link (upload)
Folder
;
Add files
Add folder
BitTorrent
Enable BitTorrent protocol support
Limit upload traffic
Limit the number of upload connections
Use ports in the range from
to
Enable DHT
Enable/disable BitTorrent protocol support. However, if there are any BitTorrent downloads in the list or in FDM Recycle Bin, BitTorrent protocol will not be disabled completely.
Limit the maximum total speed of upload connections. This is not recommended for BitTorrent protocol and may reduce your download speed.
Limit the maximum number of total upload connections. Setting a too low number may result in decreasing of your downloading speed.
Specify here the range of ports that FDM will use for upload connections.
Enable DHT extension (download without using the tracker). Enabling this option will affect the increase of network traffic usage.
Name
Login is required for the tracker
Add BitTorrent download
An error occurred while trying to process this torrent file.
Torrent file
It seems that you would like to download a .torrent file. It's required to enable BitTorrent support in Free Download Manager to do this.\n\nWould you like to enable BitTorrent?
Retype your passwords: passwords you've typed do not match.
Specify the files you would like to upload.
Upload properties
Metalink info file has been detected. Continue downloading.
BitTorrent info file has been detected. Continue downloading.
Failed to access the files on the disk.
Connecting tracker...
Failed to receive the valid response from the tracker.
Response has been received from the tracker successfully.
Hash check of the part of download has failed. Redownloading it...
Grant all bandwidth for this download
Disable Free Download Manager automatic loading at Windows startup?
Sorry, FDM Community service is currently unavailable. Please try again later.
Name of the file should not contain any of \ / : * ? " < > | symbols. Please enter another name.
Name of the folder should not contain any of : * ? " < > | symbols. Please enter another name.
Customize floating windows...
Transparency
Data
Keep all data files in the current user's folder
Keep files in this folder
Changes will be applied after the restart of Free Download Manager.
Show download progress window
Create portable version
Portable version of Free Download Manager can be used on different computers without the need to install and configure it on each computer.\n\nIt can be conveniently placed on a flash disk, for example.\n\nOnce launched, it registers itself in the computer's system and integrates to browsers. At exit it will unregister itself automatically.\n\nSpecify here the path where you would like to create this version. It should be a folder on some removable drive.\n\nE.g. "I:\My portable programs\".
Integration
Associate with torrent files
Always use this group for new downloads
Always use this group and remember the last output folder each time
Flash video downloads
Download video with FDM
This site is not supported. See the list of supported sites.
View in Downloads window
This is the page with flash video. Downloading flash video...
Converting...
Convert
Convert options
File format
Video size
; video quality
Quality
Very low
Low
Normal
Average
High
Very high
;
AVI using MPEG-4 (*.avi)
AVI using XVID (*.avi)
Don't change
Video bitrate
Audio bitrate
Remember settings as default
;
Create flash video download
Automatically convert downloaded video to the specified format
Setup advanced options
View list of supported sites
; used in "create flash video download" window
e.g.
Next attempt to connect to tracker in %d seconds
Preparing files on the disk... This may take several minutes
State
Preparing files on the disk...
MP4 for iPod/PSP (MPEG4 + AAC, *.mp4)
Media preview/convert
Convert media file
Switch to this tab automatically
;keep "\n\n%s\n" as is
Media file has been converted successfully and stored in\n\n%s\n.
Failed to convert media file\n\n%s.
Group for new download
Info hash
Peers
Client
Pieces
Tracker
Tracker status
Upload speed
Bytes uploaded
Share ratio
Wasted byte count
Torrent file URL
Are you sure?\nThis will restart the download from the beginning.
Traffic used ("downloaded"; "uploaded") this month\n(%s was used in the previous month)
Total speed ("download"; "upload")
Files to upload
Package name
Compress
Set password for this download
Retype
Keep these files
Supposed number of downloads
Add link to these files in our catalogue
Include advanced information (all fields are optional)
Description
Tags
Your name
Your email
Receiver's email
Less than 10
From 10 to 100
More than 100
2 days
7 days
1 month
;compression methods
None
Fast
Average
Best
Uploader settings
Integrate uploader into
Explorer's context menu
Explorer's "Send To..." menu
Use simple upload menu
Minimum size of file to upload
HTTP proxy settings
Upload activation
Upload requires activation. This is required in order to protect our server from automatic uploads. Enter activation code.
Connecting to upload server
Successfully connected to upload server
File has been uploaded to server successfully
File upload was stopped
Creating zip archive of uploading files...
Failed to create zip archive
Zip archive has been created successfully
Sending the request to server
Sending information about this upload to server
Information has been sent
Failed to send information about this upload to server
Activating upload...
Upload has been activated successfully
Failed to activate upload
Upload file was changed on the disk
Unexpected error
Calculating checksum...
; "I agree to terms" string in two lines
I agree to
terms
You must agree to terms.
Failed to check for updates
New version is available. It is required to update your version.\nWould you like to update now?
Update of Free Download Manager is required
Restart of Free Download Manager is required
Prompt me to upload attachments
Attach to the letter (slow)...
Upload and insert link (lightning fast)...
An error occurred while trying to start uploading. Check your connection or try again later.
You have attached large file(s).\nDue to many reasons it's recommended not to send large files as attachments, but upload files and send links to them.\n\nWould you like to upload?
Upload is recommended
Integration settings
Upload of %s has been completed.\nYou should use the following URL as the download link:
Total size
Open in the browser
Current version of Free Download Manager cannot longer be used to upload files. It's required to update it.
Current version of Free Upload Manager cannot longer be used. It's required to update it. Please visit freedownloadmanager.org site.
Too long input.
Upload manager integration settings
Free Upload Manager integration settings
Upload
Downloading update...
Enable seeding
Disable seeding by default
Consider download malicious if minimum
% of users marked it as malicious
OK, Free Download Manager's users did not report this download as malicious.\n\nHowever, this does not guarantee that this download is not malicious and it is recommended to check it using some antivirus program.
OK, FDM's users did not report that this download is malicious
drive letter FDM was started from. E.g. "C:". Is useful for portable version.
You should install Video Conversion plugin in order to use this feature.
You should install BitTorrent plugin in order to download via BitTorrent protocol.
Note: these files (*.sav) are Free Download Manager's service files (not the files you download).
Would you like to copy current data files to a new folder (existing files will be overwritten)?
Default download folders of all groups will be set to this folder.\nOK to continue?
Set default download folder
Prevent computer from stand by while downloading
Maximum number of half-open connections
Torrents
Failed to access the files on the disk. Check if disk is full or write protected.
Ratio
List of torrents
Add torrent download from web
Add torrent download from file
Create new torrent
(auto)
Source
Piece size
Trackers
Add tracker
Remove tracker
Start seeding this torrent
Save
Create new torrent
Torrent files
Priority
;normal/high priority
skip
normal
high
Floating windows
Service files (list of downloads, history, etc.)
Default settings for site downloads
You have paused all downloads. This means all downloads will download at a very low speed (1B/s usually).\nThis allows to "pause" even downloads with no resume support.\n\nYou should call this command again or restart FDM in order to return to normal state.
Seeding
Enable seeding (highly recommended)
Unlimited seeding
Limit by ratio
Seed until ratio will be
Limit by time
Seed during
Check if download with the same URL already exists
Save history of downloads
List my most recently downloaded files
Default settings of BitTorrent downloads
Restart completed downloads
Specify Firefox's portable version folder.
Can't find Apple Safari Plugin directory. Do you wish to specify it manually?
Can't find Google Chrome Plugin directory. Do you wish to specify it manually?
Can't install Apple Safari monitoring
Can't uninstall Apple Safari monitoring
Can't install Google Chrome monitoring
Can't uninstall Google Chrome monitoring
Time Limit
;hours, for shprt
hr.
Limit time when FDM can start downloads
Allow to start only from
Normal priority
High priority
Essential
No timeout for download completion balloons
Check if a new download is the mirror for existing one
Show small notification windows on downloads completion
Automatically hide after
Like FDM? Try Personal Informer!
The latest version of FDM comes with a free bonus: Personal Informer.
It places quick links to all your
favorite sites
; next line means --- after you start _browser_. "_browser_" will be Internet Explorer or Firefox
on your homepage, so that you can access them right after you start
; \n means next line. don't change this.
We will analyze your browsing history and show you the list\nof the web sites you visited we think you might like\nto have on your webpage. You will we able to customize\nthe list then.
Are you sure? The whole process is going to take less than 1 minute and give you a really powerful home page.
Still Cancel
Proceed
Do you want us to remind you in a few days?
Title
Monitor flash video downloads in browsers
Using this feature can cause conflicts with other software installed on your PC. If you experience problems you will have to disable this feature in FDM or try to resolve conflicts by removing conflicting software or disabling some of its features.
Web page
Flash videos found on this page
You should enable monitoring of flash video downloads for this. See Options | Downloads | Flash Video.
Enter the URL of the web page you want to download flash videos from. Note that this page must already be loaded in your browser and videos should be playing.
Searching flash videos...
There were no flash videos found on this page. Make sure the videos on this page are playing or try to reload it (refresh page or clear browser's cache).
; keep "0x%x" as is
An error occurred while trying to get downloads.\nError: 0x%x.
Error
Show "Download It" button
(Internet Explorer only)
Failed to found information about this web page. Please force your browser to reload it.
Flash Video
Limit the maximum number of connections
This will disable FDM tips. Are you sure?\nYou can enable tips again in Options | Notifications settings.
Show Tips
Error! Update file is not signed by FreeDownloadManager.ORG.
; 
; Also, please download and translate this file:
;  http://freedownloadmanager.org/tips-eng.txt
; Note, that it's UTF-8 encoded file (use Notepad.exe to edit).
;  and do not change text in tags (between "<>", e.g. "<a href...>")
; Send translated file to support@freedownloadmanager.org.
;
;
(Internet Explorer and Firefox only)
Show "Download It" button
Flash video monitoring module is not loaded. Make sure FDM is running and you've enabled this option in FDM (see Options | Downloads | Flash Video).
; do not change "0x%x"
An error occurred while trying to transfer downloads to FDM.\nError: 0x%x.
Download It
Show This Button
There are no downloads to export.
There is nothing to export.
after "silent" creation
You'll need to provide administrator permission to enable/disable monitoring.
An error occured while trying to enable/disable integration.
Not enough rights
You'll need to provide administrator permission to export/import settings.
Download with FDM
; please keep %d, %s and %% as is
; %d - percents
%d%% downloaded in total
; left to download at... some speed
%s left to download at
Path to user profile folder.
Import µTorrent downloads
µTorrent save folder not found!
FDM can import all your existing µTorrent downloads. Would you like to import?\nYou can do it in any time later by using File | Import | µTorrent Downloads menu.
FDM can import all your existing µTorrent downloads.\nYou can do it in any time later by using File | Import | Import Downloads from Other Managers menu.
Import Downloads from Other Managers
Orbit Downloader
LeechGet
Cannot find the path to the Orbit Downloader's application data.
Cannot detect the path to the Orbit Downloader's application data.
Error: %d (%02X)
System diagnostics: %s
Cannot find the Orbit Downloader's service file that contains the downloads list.
Cannot read the Orbit Downloader's downloads list.
Cannot parse the Orbit Downloader's downloads list. The downloads list has an unexpected format.
Failed to create and configure %d download(s) by a path, file name and URL imported from the Orbit Downloader.
Cannot import the downloads.
There is no data in the Orbit Downloader's download list!
The Orbit Downloader is not installed on this machine!
The import of the downloads from the %s has been stopped because of the following error.
Would you like to continue the import from other managers?
Processed:
Successful:
Failed:
Unprocessed:
Total:
µTorrent
undefined
%d of %d
Choose the managers which you want to import the downloads from:
FDM can import downloads from other managers. Would you like to import?\nYou can do it in any time later by using File | Import | Import Downloads from Other Managers menu.
Details: %s
Cannot process a peer request.
Fatal error occurred while loading the list of downloads.\nClick OK to continue (some or all downloads will be lost) or CANCEL to exit.\nThis problem can be caused by incorrect installation of FDM or damaged data file.
Invalid installation: installed Bittorrent module can't be used with this version of FDM.\nPlease reinstall.\nClick OK to exit.
; %d - is the number
%d peers received
Such Bittorrent download exists already
You'll need to provide administrator permission to apply settings.
Determine automatically
Choose...
Connection speed
Settings for traffic usage modes
% of connection speed
Manage automatically
; set some setting (maximum number of connections, for example) to some number
Set to
The current connection speed is measured by FDM automatically. If you suspect that the values are incorrect, just let FDM keep on running and you should see the calculated numbers get closer to the real values. Note that FDM measures the speed only when it's downloading/uploading. The greater the number of downloads/uploads, the better FDM detects the actual connection speed.
Download speed
Measure again
Specify value
The value must be greater than or equal to zero.
Specify in bits instead of bytes
Create RTSP or MMS download
Live Streaming
Retry
Abort All
Tried to move the file:\n %s\n\n to the destination folder under this name:\n %s\n\n%s: %s\n\nPlease close all applications that may be using this file.
Unsupported content-encoding
Select all
Reset all
Administrator rights are required to integrate FDM into Internet Explorer. Choosing "Cancel" will integrate it partially.
; %s will be replaced with the actual browser name
Can't delete the browser plugin while %s is running. Please close the browser and click OK to continue.\nClick Cancel to postpone the deletion of the plugin to system reboot.
Can't delete the browser plugin for %s. It will be deleted on system reboot.
Associate with magnet links
Enable Local Peer Discovery
Enable UPnP
Enable NAT-PMP
Enable µTorrent Peer Exchange
Changes will take effect after you restart Free Download Manager
The video you selected has the audio data stream in a separate file.\nIt must be downloaded also for the video to have audio channel.\nThe appropriate audio file has been selected for downloading.\nIt will be automatically merged with the video download as soon as both downloads completes.
The video(s) you selected has the audio data stream in a separate file.\nThis audio download must be downloaded also for the video to have audio channel.\nAre you sure you do not want it to be downloaded?\nChoose Yes to download video file without audio channel.
Waiting for the media merge task to begin
Media merge task succeeded
Media merge task failed
Media merge task has started
Download YouTube video
Video formats found on this page
YouTube video download detected.\nWould you like to download it as YouTube video?
Video monitoring
Video downloads
Additional components required for this feature to work.\nWould you like to download them?
Downloading and installing additional components
Error installing additional components.
A tiny button which helps to download videos from YouTube.com with few clicks.\nIn order to enable this button for other video sites - please enable "Monitor flash downloads in browsers" option.
File size is too large for the target file system.
; %s means browser name; do not remove it
Administrator rights are required to integrate FDM into %s.
Please don't pause this downloads for a long time; otherwise it may need to be restarted.
You have unfinished YouTube downloads. If you stop them now, you might not be able to resume them later. Exit anyway?
If you stop this download for a long time, you might not be able to resume them later. Continue?
Cannot resume download, please restart it manually.
Sequential downloads
New version of flash video monitoring module is available. Would you like to update?
Skip this update
Security check failure
Certificate host name is incorrect
Certificate is expired
Invalid certificate
Security check failed for host

